---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures
source: html/8d50df88-069f-aa04-f193-97d23bfe11fc.htm
---
# BuiltInFailures.ConstraintFailures Properties

A dimension that has lock constraints is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained..